---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPathType.StairsPathDirection
source: html/88664f2e-edbc-b606-046e-ac8b20a89ae5.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathType.StairsPathDirection Property

The style of the stairs path.

## Syntax (C#)
```csharp
public StairsPathDirection StairsPathDirection { get; }
```